# Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.
# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1
import funk

# Представление списка и запроса в виде кортежа
t1 = (["qwe", "asd", "zxc", "qwe", "ertqwe"],'qwe')

t2 = (["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"],"йцу")

t3 = (["йцу", "фыв", "ячс", "цук", "йцукен"],"йцу")

t4 = (["123", "234", 123, "567"],"123")

t5 = ([],"123")

List = [t1,t2,t3,t4,t5]

for i in List:
    funk.Find_Second(i[0],i[1])

# for i in range(1,6):
#     a= locals()['t'+str(i)] # трансформация строки в локальную переменную (вносит строку в таблицу локальных символов)
#     funk.Find_Second(a[0],a[1])