# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример: - [2, 3, 4, 5, 6] => [12, 15, 16]
#         - [2, 3, 5, 6] => [12, 15]

import random

n = abs(int(input('Задайте количество элементов списка: ')))
list = [random.randint(1,10) for i in range(n)]
print(list)

print([list[i]*list[n-1-i] for i in range(int(len(list)/2+0.5))])